//#include "StdAfx.h"
#include "headfile.h"
#include "Data.h"
/*
double xi[NVARS][D] = {0};          //解的位置向量
double vi[NVARS][D] = {0};          //解的速度向量
double pBest_array[NVARS][D] = {0}; //自身的历史最优解位置向量值
double pBest_value[NVARS] = {0};     //自身的历史最优解值
double gBest = 0;               //全局最优向量值
int gBest_i = 0;                //全局最优向量下标值
*/
double result[CALTIMES] = {0};          //30次计算的结果  
double sum = 0;                 //30次计算之和              
double arg = 0;                 //平均数
double sigma = 0;               //标准差

FUN FunArray[FUNNUM];
//函数变量的取值范围
double range[FUNNUM][2] = {
	{-100,100},
	{-10,10},
	{-100,100},
	{-100,100},
	{-30,30},
	{-100,100},
	{-1.28,1.28},
	{-500,500},
	{-5.12,5.12},
	{-32,32},
	{-600,600},
	{-50,50},
	{-50,50}
};

double range1[26][2] = {
	{0, 0}, {-100, 100}, {-100, 100}, {-100, 100}, {-100, 100}, {-100, 100}, {-100, 100}, {0, 600}, {-32, 32}, {-5, 5}, /* 1-9 */
	{-5, 5}, {-0.5, 0.5}, {-PI, PI}, {-5, 5}, {-100, 100}, {-5, 5}, {-5, 5}, {-5, 5}, {-5, 5}, {-5, 5}, /* 10-19 */
	{-5, 5}, {-5, 5}, {-5, 5}, {-5, 5}, {-5, 5}, {2, 5} /* 20-25 */
};   

/* min values of 25 functions */
double fmin[26] = {
	0, -450, -450, -450, -450, -310, 390, -180, -140, -330,  /* 1-9 */
	-330, 90, -460, -130, -300, 120, 120, 120, 10, 10, /* 10-19 */
	10, 360, 360, 360, 260, 260 /* 20-25 */
};